apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_pinmap.h
#define GPIO_LPTIM2_CH1_1    (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_LPTIM2_CH1_2    (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_LPTIM2_CH1_3    (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_LPTIM2_CH2_1    (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_LPTIM2_CH2_2    (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_LPTIM2_CH2_3    (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_LPTIM2_IN1_1    (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPTIM2_IN1_2    (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPTIM2_IN1_3    (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_LPTIM2_ETR_1    (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_LPTIM2_ETR_2    (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_LPTIM2_ETR_3    (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN11)

#define GPIO_LPTIM3_CH1_1    (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_LPTIM3_CH1_2    (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPTIM3_CH1_3    (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_LPTIM3_CH1_4    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_LPTIM3_CH2_1    (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPTIM3_CH2_2    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_LPTIM3_CH3_1    (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_LPTIM3_CH3_2    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_LPTIM3_CH3_3    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_LPTIM3_CH3_4    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN13)
#define GPIO_LPTIM3_CH4_1    (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_LPTIM3_CH4_2    (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_LPTIM3_IN1_1    (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPTIM3_IN1_2    (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_LPTIM3_IN1_3    (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_LPTIM3_IN2_1    (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_LPTIM3_IN2_2    (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_LPTIM3_ETR_1    (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_LPTIM3_ETR_2    (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_LPTIM3_ETR_3    (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN10)

/* USART */

#define GPIO_USART1_CTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_CTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_USART1_RTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART1_RTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_USART1_RX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN10)
#define GPIO_USART1_RX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART1_TX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_USART1_TX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)

#define GPIO_USART2_CTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_CTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_USART2_RTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_USART2_RTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_USART2_RX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_USART2_RX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART2_RX_3     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN6)
#define GPIO_USART2_TX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_USART2_TX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN5)

#define GPIO_USART3_CTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_USART3_CTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_CTS_3    (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_USART3_RTS_1    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART3_RTS_2    (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_USART3_RTS_3    (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART3_RTS_4    (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_USART3_RTS_5    (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_USART3_RX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_USART3_RX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)
#define GPIO_USART3_RX_3     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN11)
#define GPIO_USART3_RX_4     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)
#define GPIO_USART3_RX_5     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART3_RX_6     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN9)
#define GPIO_USART3_TX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_USART3_TX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_USART3_TX_3     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_USART3_TX_4     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN4)
#define GPIO_USART3_TX_5     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN10)
#define GPIO_USART3_TX_6     (GPIO_ALT | GPIO_PULLUP | GPIO_AF7 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN8)

#define GPIO_USART4_CTS_1    (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART4_RTS_1    (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART4_RX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN1)
#define GPIO_USART4_RX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART4_TX_1     (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART4_TX_2     (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN10)

/* LPUART */

#define GPIO_LPUART1_CTS_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_LPUART1_CTS_2   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPUART1_RTS_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPUART1_RTS_2   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_LPUART1_RX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_LPUART1_RX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPUART1_RX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPUART1_TX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_LPUART1_TX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN11)
#define GPIO_LPUART1_TX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN1)

#define GPIO_LPUART2_CTS_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_LPUART2_RTS_1   (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPUART2_RX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_LPUART2_RX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPUART2_RX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN1)
#define GPIO_LPUART2_RX_4    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_LPUART2_TX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LPUART2_TX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN11)
#define GPIO_LPUART2_TX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPUART2_TX_4    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)

#define GPIO_LPUART3_CTS_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_LPUART3_CTS_2   (GPIO_ALT | GPIO_AF8 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_LPUART3_RTS_1   (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_LPUART3_RTS_2   (GPIO_ALT | GPIO_AF8 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_LPUART3_RX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_LPUART3_RX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF6 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_LPUART3_RX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)
#define GPIO_LPUART3_RX_4    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN9)
#define GPIO_LPUART3_TX_1    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN4)
#define GPIO_LPUART3_TX_2    (GPIO_ALT | GPIO_PULLUP | GPIO_AF6 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LPUART3_TX_3    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN4)
#define GPIO_LPUART3_TX_4    (GPIO_ALT | GPIO_PULLUP | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN8)

/* USB */

#define GPIO_USB_NOE_1       (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_USB_NOE_2       (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN9)

#endif /* __ARCH_ARM_SRC_STM32U0_HARDWARE_STM32U0_PINMAP_H */
